{
  "projects": [
    {
      "visible": true,
      "category": "Full-Stack ",
      "title": "Twitter Showcase",
      "description": " This application displays data from the twitter api, users can search tweets based on keywords and usernames. It also has a feature where it displays random tweets from five different users. The application is written with react and javascript in the front-end and node and express in the back-end. I enjoyed working on this app and learnt about query strings, dependencies, json, proxy, dot env, react router and media keys.  My favorite part of this project was connecting the front-end and the back-end, passing data from front-end to back-end and retrieving the api data on the front-end. Click on the image for the live version.  *** Unfortuanately the Twitter API is depreciated the appliaction will not fetch from the endpoints.Please followe the video explanation.*** " ,
      "tags": ["React", "Node", "Express", "Bootstrap"],
      "image": {
        "src": "../../images/Flybird.jpg",
        "alt": "Quick Setup",
        "linkTo": "https://www.youtube.com/watch?v=CJvLSxJg4gg"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/Ris345/Twitter-Showcase-App"
        },
        {
          "type": "live",
          "url": "https://www.gatsbyjs.org/docs/mdx/writing-pages/"
        }
      ]
    }, 
    {
      "visible": true,
      "category": "Front-End ",
      "title": "Star Wars Search App",
      "description": "This application searches your favorite Star Wars character and delivers information about them -- This project was a good opportunity for me to learn about asynchronous programming , Rest API's , promises and HTTP requests. My favorite part of this project was learning about HTTP requests and being able to make multiple requests without interrupting the flow of the application. You can check out the live version of the application by clicking on the image. ",
      "tags": ["React", "Axios", "Bootstrap"],
      "image": {
        "src": "../../images/StarWars.jpg",
        "alt": "Extendable Layout",
        "linkTo": "https://magenta-crisp-21b3fc.netlify.app/"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/Ris345/Star-Wars-App-"
        }
      ]
    },
    {
      "visible": true,
      "category": "Front-End ",
      "title": "Expense Tracker",
      "description": "This application helps users track their spending, by entering expense type, date, payment method and amount. Users can also add and delete expenses, the app saves data in local storage. I  enjoyed working on this app, and learnt about State, Props and Components. My favorite part was understanding state and being able to manipulate data anywhere, even outside the scope of a function. You can click on the image for the live version. ",
      "tags": ["React", "Bootstrap"],
      "image": {
        "src": "../../images/ExpenseTracker.jpg",
        "alt": "Quick Setup",
        "linkTo": "https://handy-expense-tracker.netlify.app/"
      },
      "links": [
        {
          "type": "github",
          "url": "https://github.com/Ris345/Expense-Tracker.github.io"
        },
        {
          "type": "live",
          "url": "https://www.gatsbyjs.org/docs/mdx/writing-pages/"
        }
      ]
    }
  ],
  "button": {
    "visible":true,
    "label": "Visit on Github",
    "url": "https://github.com/Ris345"
  }
}
